In [3]:
import pandas as pd

# create df

In [2]:
df = pd.DataFrame(columns=['Name', 'Age', 'Height'])

df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

## insert data

In [4]:
df.loc[0] = ['Allen', 22, 175]

df

    Name  Age  Height
0  Allen   22     175

In [5]:
df.loc[1] = ['Ted', 25, 180]
df.loc[2] = ['Jack', 28, 177]

df

    Name  Age  Height
0  Allen   22     175
1    Ted   25     180
2   Jack   28     177

In [6]:
df['Age']

0    22
1    25
2    28
Name: Age, dtype: int64

In [7]:
# create new column
df['weight'] = [75, 80, 85]

df

    Name  Age  Height  weight
0  Allen   22     175      75
1    Ted   25     180      80
2   Jack   28     177      85

In [8]:
# drop column
df.drop(['weight'], axis=1)

    Name  Age  Height
0  Allen   22     175
1    Ted   25     180
2   Jack   28     177

In [11]:
df.drop(columns=['weight'], inplace=True)

In [13]:
df

    Name  Age  Height
0  Allen   22     175
1    Ted   25     180
2   Jack   28     177

In [15]:
# drop row
df.drop(2, inplace=True)

In [16]:
df

    Name  Age  Height
0  Allen   22     175
1    Ted   25     180

In [17]:
columns = ['Name', 'Age', 'Height']
data = [['Jake', 26, 180],
        ['Trump', 23, 185]
        ]

df2 = pd.DataFrame(columns=columns, data=data)

df2

    Name  Age  Height
0   Jake   26     180
1  Trump   23     185

In [22]:
df_union = pd.concat([df, df2]).reset_index(drop=True)

df_union

    Name  Age  Height
0  Allen   22     175
1    Ted   25     180
2   Jake   26     180
3  Trump   23     185

In [23]:
# load to csv without index, columns

df_union.to_csv('basic.csv', index=False, columns=None)

In [24]:
# copy

df_replica = df.copy()

In [25]:
df['Height'] = 180

df

    Name  Age  Height
0  Allen   22     180
1    Ted   25     180

In [26]:
df_replica

    Name  Age  Height
0  Allen   22     175
1    Ted   25     180